Setting = {}
Setting.Keys = {
	["ESC"] = 322, ["F1"] = 288, ["F2"] = 289, ["F3"] = 170, ["F5"] = 166, ["F6"] = 167, ["F7"] = 168, ["F8"] = 169, ["F9"] = 56, ["F10"] = 57,
	["~"] = 243, ["1"] = 157, ["2"] = 158, ["3"] = 160, ["4"] = 164, ["5"] = 165, ["6"] = 159, ["7"] = 161, ["8"] = 162, ["9"] = 163, ["-"] = 84, ["="] = 83, ["BACKSPACE"] = 177,
	["TAB"] = 37, ["Q"] = 44, ["W"] = 32, ["E"] = 38, ["R"] = 45, ["T"] = 245, ["Y"] = 246, ["U"] = 303, ["P"] = 199, ["["] = 39, ["]"] = 40, ["ENTER"] = 18,
	["CAPS"] = 137, ["A"] = 34, ["S"] = 8, ["D"] = 9, ["F"] = 23, ["G"] = 47, ["H"] = 74, ["K"] = 311, ["L"] = 182,
	["LEFTSHIFT"] = 21, ["Z"] = 20, ["X"] = 73, ["C"] = 26, ["V"] = 0, ["B"] = 29, ["N"] = 249, ["M"] = 244, [","] = 82, ["."] = 81,
	["LEFTCTRL"] = 36, ["LEFTALT"] = 19, ["SPACE"] = 22, ["RIGHTCTRL"] = 70,
	["HOME"] = 213, ["PAGEUP"] = 10, ["PAGEDOWN"] = 11, ["DELETE"] = 178,
	["LEFT"] = 174, ["RIGHT"] = 175, ["TOP"] = 27, ["DOWN"] = 173,
	["NENTER"] = 201, ["N4"] = 108, ["N5"] = 60, ["N6"] = 107, ["N+"] = 96, ["N-"] = 97, ["N7"] = 117, ["N8"] = 61, ["N9"] = 118
}
Setting.AntiCombatLog = true -- enable anti-combat logging?

Setting['ตายแล้วตัวล่องหน'] = true

Setting['ตายแล้วมีพร็อพบนหัว'] = false 
Setting['พร็อพ'] = 'cooldown_heading' ------- พร๊อบที่โชว์บนหัว

Setting['เวลาที่ติดคลูดาวน์'] = 60
Setting['ปิดปุ่มโจมตี'] = true 
Setting['โซนที่ไม่ติดคลูดาวน์'] = {
    ['โซน ชิงธง'] = {
        ['ตำแหน่ง'] = vector3(-962.09997558594, 3416.3999023438, 548.28009033203),
        ['ระยะ'] = 100
    },
}

Setting['ไอเทมใช้ชุบ'] = 'aed'   --- ชื่อยาชุบ
Setting['ไอเทมใช้แล้วปิดคลูดาวน์'] = 'recooldown'
Setting['เวลาในการใช้ยาชุบ'] = 8 --- วินาที  
Setting['เลือดตอนฟื้น'] = 120 

Setting['ลูปการปิดปุ่มต่อย'] = 6 --- ถ้าคูลดาวแล้วยังต่อยได้ ใส่ 0-10 ไล่ไปดูนะครับ
Setting['ดีเลย์การเช็คในโซน'] = 500 ---- ถ้าใช้ยาชุบแล้วติดคูลดาวน์ แสดงว่าบั๊คกับสคริปหมอ ให้แก้ตรงนี้ เป้นเลข 500 , 1000 , 2000 ดู


local second = 1000
local minute = 60 * second

Setting.RespawnTime  = 5*second-- เวลาเกิด

Setting.ReviveItem = "aed" -- ชื่อไอเทมชุบชีวิต
Setting.ReviveTime = 10000 -- เวลาในการชุบ