Setting = Setting or {}

Setting['ตายแล้วตัวล่องหน'] = true

Setting['ตายแล้วมีพร็อพบนหัว'] = false 
Setting['พร็อพ'] = 'cooldown_heading' ------- พร๊อบที่โชว์บนหัว

Setting['ระยะการมองเห็น'] = 10
Setting['เวลาที่ติดคลูดาวน์'] = 60
Setting['ปิดปุ่มโจมตี'] = true 
Setting['โซนที่ไม่ติดคลูดาวน์'] = {
    ['โซน ชิงธง'] = {
        ['ตำแหน่ง'] = vector3(-962.09997558594, 3416.3999023438, 548.28009033203),
        ['ระยะ'] = 100
    },
}

Setting['ไอเทมใช้ชุบ'] = 'aed'   --- ชื่อยาชุบ
Setting['ไอเทมใช้แล้วปิดคลูดาวน์'] = 'recooldown'
Setting['เวลาในการใช้ยาชุบ'] = 8 --- วินาที  
Setting['เลือดตอนฟื้น'] = 120 

Setting['ลูปการปิดปุ่มต่อย'] = 6 --- ถ้าคูลดาวแล้วยังต่อยได้ ใส่ 0-10 ไล่ไปดูนะครับ
Setting['ดีเลย์การเช็คในโซน'] = 500 ---- ถ้าใช้ยาชุบแล้วติดคูลดาวน์ แสดงว่าบั๊คกับสคริปหมอ ให้แก้ตรงนี้ เป้นเลข 500 , 1000 , 2000 ดู

